---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadCase
source: html/2a215599-9c4c-d817-e170-605fd705699d.htm
---
# Autodesk.Revit.DB.Structure.LoadCase

An object that represents a load usage.

## Syntax (C#)
```csharp
public class LoadCase : Element
```